OpenIPC/devourer/src/rtl8733b/Rtl8733bDevice.cpp
#include "Rtl8733bDevice.h"

#include <algorithm>
#include <chrono>
#include <cstring>
#include <span>
#include <stdexcept>
#include <thread>
#include <utility>
#include <vector>

#include "AckResponder.h" /* hardware ACK responder recipe */
#include "RateDefinitions.h"
#include "RadiotapPeek.h" /* send_packets batch pre-parse */
#include "RadiotapTxFlags.h"
#include "RxParseAbort.h" /* rx.parse_abort — abandoned-aggregate event */
#include "rtl8733b/Rtl8733bUsbIds.h"
#include "rtl8733b/TxDescriptor8733b.h"
#include "SignalStop.h"
#include "TxAggPlan.h" /* shared USB TX aggregation layout planner */

extern "C" {
#include "ieee80211_radiotap.h"
}

Rtl8733bDevice::Rtl8733bDevice(RtlAdapter device, Logger_t logger,
                               devourer::DeviceConfig cfg)
    : _device(device), _logger(std::move(logger)), _cfg(std::move(cfg)),
      _bringup(device, _logger), _mac(device, _logger),
      _phy(device, _logger) {
  _phy.set_narrowband_overrides(_cfg.tuning.nb_dac, _cfg.tuning.nb_adc);
}

Rtl8733bDevice::~Rtl8733bDevice() {
  try {
    Stop();
  } catch (...) {
    // Destruction must not terminate the process after a USB unplug/error.
  }
}

void Rtl8733bDevice::bring_up_to_phy() {
  if (_phy_ready)
    return;
  if (!_firmware_ready) {
    _chip = _bringup.read_chip_info();
    if (!_chip.matches())
      throw std::runtime_error(
          "RTL8733B identity changed during initialization");
    if (!_chip.efuse_autoload_ok)
      throw std::runtime_error("RTL8733B EFUSE autoload failed");
    /* Arm the teardown BEFORE the attempt, not after it. power_on() walks the
     * card-disable -> card-emulation -> active sequence write by write and can
     * fail at any poll with several enables already landed; latching
     * _power_ready only on success would make Stop() skip power_off() in
     * exactly the case that left the card half-enabled, and the next attempt
     * would depend on the sequence being re-enterable from an undefined state.
     * power_off() is the full HALMAC card-disable flow and is safe to run
     * against a partially enabled card. */
    _power_ready = true;
    if (!_bringup.power_on())
      throw std::runtime_error("RTL8733B card-enable sequence failed");
    if (!_mac.read_efuse(_efuse))
      throw std::runtime_error("RTL8733B EFUSE read/parse failed");
    _fw_boot = {.supported = true, .attempted = true};
    const bool firmware_ok = _bringup.download_default_firmware(_chip.cut);
    _fw_boot.attempted = _bringup.download_attempted();
    _fw_boot.checksum_ok = _bringup.checksum_ok();
    _fw_boot.ready_ok = _bringup.ready_ok();
    if (!firmware_ok)
      throw std::runtime_error("RTL8733B firmware download/boot failed");
    if (!_mac.initialize(_efuse))
      throw std::runtime_error("RTL8733B HALMAC/MAC initialization failed");
    _mac_ready = true;
    _firmware_ready = true;
  }
  if (!_phy.initialize(_chip.cut, _efuse))
    throw std::runtime_error("RTL8733B PHY/RF initialization failed");
  _phy_ready = true;
  _logger->info("RTL8733B factory path reached PHY-ready (cut {})",
                _chip.cut);

  /* ACK window (DEVOURER_ACK_TIMEOUT_US): the one library default every
   * generation programs identically, replacing the vendor value init_wmac just
   * wrote (0x21 = 33 us — the bottom of the 33..128 per-chip spread the single
   * default exists to abolish). Same clamp as jaguar1/2/3, applied here to
   * both the normal and CCK response-window registers; see the DeviceConfig
   * field doc for the range budget it buys.
   *
   * Applied rather than left at the vendor value for the reason this backend
   * refuses knobs elsewhere (disable_cca, SetTxPowerIndexOverride): a config
   * value that reads as applied while the radio runs something else is the one
   * failure worse than an unported knob. The window is load-bearing here —
   * both ends of a hardware-ARQ link work on this die (SetAckResponder,
   * tx.retry_limit).
   *
   * Sited in bring_up_to_phy for the same reason the disable_cca warning below
   * is: it is where the MAC bring-up that wrote the vendor value has just run,
   * once per bring-up, on both the RX and TX session shapes. */
  const uint8_t ackto_want = static_cast<uint8_t>(
      _cfg.tx.ack_timeout_us > 255   ? 255
      : _cfg.tx.ack_timeout_us < 1 ? 1
                                   : _cfg.tx.ack_timeout_us);
  const auto ackto = _mac.set_ack_timeout_us(ackto_want);
  if (ackto.non_cck != ackto_want || ackto.cck != ackto_want) {
    _logger->error(
        "RTL8733B: ACK window did not latch — REG_ACKTO={} us "
        "REG_ACKTO_CCK={} us, wanted {} us",
        ackto.non_cck, ackto.cck, ackto_want);
    throw std::runtime_error("RTL8733B: configured ACK window did not latch");
  }
  if (!ackto.writes_ok)
    _logger->warn(
        "RTL8733B: ACK-window write reported a transport failure, but both "
        "register readbacks match {} us",
        ackto_want);
  _logger->info(
      "RTL8733B: ACK window {} us (REG_ACKTO 0x640 + CCK 0x639, verified)",
      ackto_want);
  /* DEVOURER_ACK_RESPONDER — opt-in only, never a default: it turns a passive
   * monitor into an active SIFS-timed transmitter. Sited here with the other
   * bring-up knobs so an RX-only session (Init) arms it too, which is the
   * session shape a pure responder actually runs. */
  if (_cfg.rx.ack_responder &&
      !SetAckResponder(*_cfg.rx.ack_responder)) {
    /* The caller asked for a responder, not a monitor. Swallowing the refusal
     * here would hand back a green init and a session that silently answers
     * nothing — the operator then debugs the RF link instead of the config
     * (a group MAC in DEVOURER_ACK_RESPONDER is the easy way in: the canonical
     * TX SA 57:42:.. has the I/G bit set). Fail the bring-up instead; the
     * setter has already logged which of the two reasons applied. */
    throw std::runtime_error(
        "RTL8733B: configured ACK responder could not be armed");
  }
  /* Every other generation applies tuning.disable_cca during bring-up
   * (jaguar1/2/3, kestrel all call SetCcaMode there), so a caller setting
   * DEVOURER_DIS_CCA=1 reasonably expects it to take effect. This backend has
   * not located and measured the HALMAC 87xx carrier-sense gate, so it cannot
   * honour the request — say so once, loudly, rather than dropping it in
   * silence, which is the one way a refused knob can look like a granted one:
   * the operator would otherwise believe carrier-sense was off and read the
   * resulting deferral as a transmitter problem.
   *
   * Deliberately a warning and not the throw SetCcaMode(true) raises: the knob
   * is on by default for the streamtx FPV downlink, and failing bring-up
   * outright is a harsh answer to a request the caller may be making only via
   * an inherited environment. The session runs with standard carrier-sense.
   *
   * Sited in bring_up_to_phy rather than InitWrite so an RX-only session that
   * set the knob is told too, and so it fires exactly once per bring-up. */
  if (_cfg.tuning.disable_cca)
    _logger->warn(
        "RTL8733B: DEVOURER_DIS_CCA / tuning.disable_cca is not implemented by "
        "this backend — carrier-sense stays ENABLED for this session");
  /* DEVOURER_TX_REPORT: the CCX per-frame TX-status path is not ported. The
   * descriptor and receive-side pieces were checked, but this backend lacks
   * the H2C/MEDIA_STATUS_RPT path needed to register the MACID, so the observed
   * absence of C2H reports is not assigned to firmware. The full bench
   * narrative lives in src/rtl8733b/CLAUDE.md "Hardware ARQ".
   *
   * Warn rather than drop it silently: a consumer that sets this knob is
   * asking for its per-frame delivery sensor, and would otherwise read the
   * absence of tx.report events as a quiet link rather than an absent
   * feature. */
  if (_cfg.tx.report)
    _logger->warn(
        "RTL8733B: DEVOURER_TX_REPORT / tx.report is not implemented by this "
        "backend — no CCX reports were observed, and the H2C/MACID "
        "registration path is missing (see src/rtl8733b/CLAUDE.md)");
}

void Rtl8733bDevice::Init(Action_ParsedRadioPacket packetProcessor,
                          SelectedChannel channel) {
  try {
    {
      std::lock_guard<std::recursive_mutex> lock(_reg_mu);
      /* Bring-up forgets any armed busy window: the BB is reprogrammed and
       * retuned below, so a window armed against the previous state describes
       * a chip that no longer exists.
       *
       * INSIDE _reg_mu — which is held across the whole bring-up — and scoped
       * within it so the CCX lock is never held across a call that re-enters
       * this class. Ahead of _reg_mu the reset would be close to pointless:
       * with_ccx takes _reg_mu first, so an arm landing between the released
       * CCX lock and _reg_mu would survive the very bring-up the reset exists
       * to forget. Same argument as SetMonitorChannel's note below. */
      {
        std::lock_guard<std::mutex> ccx(busy_window_mutex());
        busy_window_reset();
      }
      bring_up_to_phy();
      if (!_phy.set_channel(channel))
        throw std::runtime_error("RTL8733B channel configuration failed");
      _channel = channel;
      _rx_configured_bw = channel.ChannelWidth == CHANNEL_WIDTH_40 ? 1 : 0;
      if (!_mac.configure_monitor_rx(_cfg.rx.keep_corrupted))
        throw std::runtime_error("RTL8733B monitor RX configuration failed");
    }
    /* Measurement-only live disarm. Constructed only after bring-up has
     * completed under _reg_mu, so even a zero delay cannot clear a cold port
     * and then be undone by SetAckResponder later in Init. jthread's stop
     * request bounds normal/exceptional shutdown even for a very long delay. */
    std::jthread ack_disarm_thread;
    if (_ack_disarm_after_ms) {
      const uint32_t delay_ms = *_ack_disarm_after_ms;
      _ack_disarm_after_ms.reset();
      ack_disarm_thread = std::jthread(
          [this, delay_ms](std::stop_token stop) {
            const auto deadline = std::chrono::steady_clock::now() +
                                  std::chrono::milliseconds(delay_ms);
            while (!stop.stop_requested() &&
                   std::chrono::steady_clock::now() < deadline) {
              const auto left = deadline - std::chrono::steady_clock::now();
              const auto quantum =
                  std::chrono::duration_cast<std::chrono::steady_clock::duration>(
                      std::chrono::milliseconds(25));
              std::this_thread::sleep_for(left < quantum ? left : quantum);
            }
            if (stop.stop_requested())
              return;
            _logger->info(
                "DEVOURER_ACK_DISARM_AFTER_MS: disarming RTL8733B ACK "
                "responder {} ms after completed bring-up",
                delay_ms);
            ClearAckResponder();
          });
    }
    StartRxLoop(std::move(packetProcessor));
  } catch (...) {
    Stop();
    throw;
  }
}

void Rtl8733bDevice::InitWrite(SelectedChannel channel) {
  try {
    std::lock_guard<std::recursive_mutex> lock(_reg_mu);
    /* Same as Init, and inside _reg_mu for the same reason. */
    {
      std::lock_guard<std::mutex> ccx(busy_window_mutex());
      busy_window_reset();
    }
    bring_up_to_phy();
    if (!_phy.set_channel(channel))
      throw std::runtime_error("RTL8733B channel configuration failed");
    _channel = channel;
    _rx_configured_bw = channel.ChannelWidth == CHANNEL_WIDTH_40 ? 1 : 0;
    if (!configure_tx_power(channel))
      throw std::runtime_error("RTL8733B safe TX power setup failed");
    if (_cfg.rx.enable_with_tx &&
        !_mac.configure_monitor_rx(_cfg.rx.keep_corrupted))
      throw std::runtime_error("RTL8733B monitor RX configuration failed");
    _tx_ready = true;
    _tx_submits = 0;
    /* One-shot thermal snapshot at bring-up — the PA-heating baseline for the
     * session, same as the Kestrel InitWrite snapshot. Logged, never acted on:
     * the meter is a PA-bias tracking index, not a calibrated °C sensor, and
     * docs/warm-tx-degradation.md shows it is not a validated degradation
     * predictor. Live monitoring is the caller's job via GetThermalStatus /
     * DEVOURER_THERMAL_POLL_MS. */
    const auto thermal = GetThermalStatus();
    _logger->info(
        "RTL8733B ready for bounded monitor injection: ch={} width={} "
        "thermal={}/{} delta={}",
        channel.Channel, static_cast<unsigned>(channel.ChannelWidth),
        thermal.raw, thermal.baseline, thermal.valid ? thermal.delta : 0);
  } catch (...) {
    Stop();
    throw;
  }
}

bool Rtl8733bDevice::configure_tx_power(SelectedChannel channel) {
  _tssi_tracking = false;
  /* Closed-loop TSSI is the TX-power control on a TSSI-offset PG unit, so it
   * is not optional there: the flat fallback index below is a conservative
   * bring-up value, and on-air it runs cold enough that HT rates do not
   * survive the link (measured on the DUT: MCS7 undecodable by an RTL8812AU
   * witness, 300/300 submitted, 0 captured). A unit whose EFUSE carries no
   * TSSI calibration has nothing to drive the loop and takes the flat path. */
  if (_efuse.tx_power_mode != rtl8733b::TxPowerPgMode8733b::TssiOffset) {
    /* No loop, so no actuator. A runtime offset latched BEFORE bring-up (the
     * demos' ordering: DEVOURER_TX_PWR_OFFSET_QDB is applied before InitWrite)
     * was accepted on the promise of being applied here, and there is nothing
     * to apply it to. Drop it loudly and zero the latch so the reported state
     * agrees with the chip — leaving it set would make GetTxPowerState claim an
     * offset no register carries, which is the exact failure this knob exists
     * to end. Not fatal: an unported optional knob is not a hardware-safety
     * event. */
    if (_tx_offset_qdb != 0) {
      _logger->error(
          "RTL8733B: dropping the {} qdB TX-power offset — this unit's EFUSE "
          "carries no TSSI calibration, so TX power is the fixed flat index "
          "and has no runtime actuator",
          _tx_offset_qdb);
      _tx_offset_qdb = 0;
      _tx_sat_low = false;
      _tx_sat_high = false;
    }
    return _phy.set_flat_tx_power(rtl8733b::kSafeTxAgcIndex8733b);
  }

  /* Pick the thermal-compensation curve once, from the TX mode configured at
   * this point, and leave it alone — the vendor's own setup keys the table on
   * `phydm_get_tx_rate` at TSSI-setup time and never re-selects it at runtime.
   * It is never re-selected per frame, so send_packet does no register I/O,
   * like every other generation.
   *
   * The curve choice is inert on this silicon at any temperature the part
   * reaches: the CCK and OFDM/HT tables are bit-identical for thermal deltas
   * 0..+17 and first differ at +18, while a five-minute max-duty MCS7 soak
   * plateaued at +8 after two minutes and stopped climbing. It is set from the
   * rate class anyway because that costs nothing and is what the vendor does —
   * but do not expect it to be measurable.
   *
   * Which is just as well, because this is weaker than the vendor's keying in
   * the canonical demo flow: txdemo calls InitWrite before SetTxMode, so
   * _tx_mode_default is usually unset here and the OFDM/HT table is what a
   * DEVOURER_TX_RATE=1M session loads — the CCK branch is reached only by a
   * caller that configures the mode first, or by a later SetMonitorChannel.
   * The vendor keys on the rate in flight at setup instead. Nothing chases
   * that gap, because closing it would buy a table identical to the one
   * already loaded at every delta this part reaches. */
  const bool cck_table = _tx_mode_default.has_value() &&
                         _tx_mode_default->mode ==
                             devourer::TxMode::Mode::Legacy &&
                         rtl8733b::is_cck_rate_500kbps(
                             _tx_mode_default->legacy_rate_500kbps);
  if (!_phy.prepare_tssi_bb(channel, _efuse) ||
      !_phy.prepare_tssi_thermal(_efuse, cck_table) ||
      !_phy.prepare_tssi_offsets(channel, _efuse) ||
      /* The ceiling argument stays the safe first-light value; a POSITIVE
       * session offset therefore lifts the resulting targets above it here, by
       * design (GetTxPowerCaps argues why the positive half exists). That is a
       * deliberate widening of what bring-up can program, not a hole in
       * enable_tssi_tracking's `max_target_qdbm > 64` guard, which still refuses
       * a caller that tries to raise the ceiling itself. */
      !_phy.enable_tssi_tracking(channel, _efuse,
                                 rtl8733b::kSafeTssiTargetQdbm8733b,
                                 _tx_offset_qdb))
    return false;
  _tssi_tracking = true;
  /* The enable above already installed the offset, so this recomputes the same
   * plan, writes nothing, and returns the rails it hit — which is how the
   * saturation flags stay chip-derived on the bring-up and channel-change
   * paths without a second code path for the arithmetic. */
  rtl8733b::TssiOffsetSat8733b sat;
  if (!_phy.set_tssi_offset(channel, rtl8733b::kSafeTssiTargetQdbm8733b,
                            _tx_offset_qdb, &sat))
    return false;
  _tx_sat_low = sat.low;
  _tx_sat_high = sat.high;
  return true;
}

void Rtl8733bDevice::StartRxLoop(
    Action_ParsedRadioPacket packetProcessor) {
  Action_ParsedRadioPacket rx_packet_processor = std::move(packetProcessor);
  uint8_t rx_channel = 0;
  {
    std::lock_guard<std::recursive_mutex> lock(_reg_mu);
    if (!_phy_ready || !_mac_ready)
      throw std::runtime_error("RTL8733B RX loop requires initialized hardware");
    if (_rx_active)
      throw std::runtime_error("RTL8733B RX loop is already active");
    _rx_stop = false;
    _rx_active = true;
    rx_channel = _channel.Channel;
  }
  uint64_t completions = 0;
  uint64_t frames = 0;
  uint64_t malformed = 0;
  uint64_t aggregate_mismatch = 0;
  long long parse_aborts = 0;

  auto on_data = [&](const uint8_t *data, int length) {
    if (++completions <= 8)
      _logger->debug("RTL8733B RX: completion #{} -> {} bytes", completions,
                     length);
    size_t offset = 0;
    uint8_t advertised = 0;
    uint32_t packets = 0;
    while (offset + rtl8733b::kRxDescSize <= static_cast<size_t>(length)) {
      rtl8733b::RxFrame8733b frame{};
      if (!rtl8733b::parse_rx_8733b(data + offset,
                                    static_cast<size_t>(length) - offset,
                                    frame)) {
        const size_t remaining = static_cast<size_t>(length) - offset;
        if (!devourer::rx_parse_remainder_is_zero_padding(data + offset,
                                                          remaining)) {
          ++malformed;
          devourer::emit_rx_parse_abort(
              _logger->events(), data + offset, remaining,
              static_cast<long long>(offset), length, frame.frame_len,
              frame.drvinfo_size, frame.shift, parse_aborts);
        }
        break;
      }
      if (packets == 0)
        advertised = frame.dma_aggregate_count;
      ++packets;

      Packet packet{};
      packet.RxAtrib.pkt_len = static_cast<uint16_t>(frame.frame_len);
      packet.RxAtrib.physt = frame.physt;
      packet.RxAtrib.drvinfo_sz = static_cast<uint8_t>(frame.drvinfo_size);
      packet.RxAtrib.shift_sz = frame.shift;
      packet.RxAtrib.qos = frame.qos;
      packet.RxAtrib.priority = frame.tid;
      packet.RxAtrib.mdata = frame.more_data;
      packet.RxAtrib.mfrag = frame.more_fragment;
      packet.RxAtrib.seq_num = frame.sequence;
      packet.RxAtrib.frag_num = frame.fragment;
      packet.RxAtrib.bdecrypted = frame.sw_decrypted;
      packet.RxAtrib.encrypt = frame.security;
      packet.RxAtrib.crc_err = frame.crc_err;
      packet.RxAtrib.icv_err = frame.icv_err;
      packet.RxAtrib.tsfl = frame.tsfl;
      packet.RxAtrib.data_rate = frame.rx_rate;
      packet.RxAtrib.paggr = frame.paggr;
      packet.RxAtrib.ppdu_cnt = frame.ppdu_count;
      packet.RxAtrib.pkt_rpt_type = frame.c2h
                                       ? RX_PACKET_TYPE::C2H_PACKET
                                       : RX_PACKET_TYPE::NORMAL_RX;
      bool phy_parsed = false;
      if (!frame.c2h && frame.physt && frame.drvinfo_size >= 24)
        phy_parsed = rtl8733b::parse_phy_status_8733b(
            data + offset + rtl8733b::kRxDescSize, frame.drvinfo_size,
            frame.rx_rate, _rx_configured_bw.load(),
            packet.RxAtrib);
      packet.Data = std::span<uint8_t>(const_cast<uint8_t *>(frame.frame),
                                       frame.frame_len);
      if (rx_packet_processor)
        rx_packet_processor(packet);
      /* First-frames breadcrumb: per-frame diagnostics belong on the debug
       * plane, like every other generation's RX walk. */
      if (++frames <= 8) {
        const uint8_t *status = data + offset + rtl8733b::kRxDescSize;
        _logger->debug(
            "RTL8733B RX: frame len={} rate={} crc={} c2h={} physt={} drv={} "
            "page={} phy_ok={} rssi={}",
            frame.frame_len, frame.rx_rate, frame.crc_err, frame.c2h,
            frame.physt, frame.drvinfo_size,
            frame.drvinfo_size != 0 ? status[0] & 0x0f : 0xff, phy_parsed,
            packet.RxAtrib.rssi[0]);
      }

      if (frame.next_offset == 0)
        break;
      offset += frame.next_offset;
      if (advertised != 0 && packets >= advertised)
        break;
    }
    if (advertised != 0 && packets != advertised)
      ++aggregate_mismatch;
  };

