OpenIPC/devourer/src/rtl8733b/Rtl8733bDevice.cpp
  /* Floor at the device-side aggregate ceiling, not at some generic minimum: a
   * URB smaller than one aggregate lets the aggregate straddle two completions,
   * which is the exact failure the 12 KiB cap was introduced to remove (the
   * walk stays in bounds, but every split aggregate becomes a malformed abort
   * and its frames are lost). DEVOURER_RX_URB_BYTES may raise this, never
   * lower it below rtl8733b::kRxAggregateBytes8733b. */
  int urb_bytes = _cfg.rx.urb_bytes.value_or(16 * 1024);
  if (urb_bytes < rtl8733b::kRxAggregateBytes8733b) {
    if (_cfg.rx.urb_bytes)
      _logger->warn(
          "RTL8733B RX: raising urb_bytes {} -> {} (device RX aggregate cap)",
          urb_bytes, rtl8733b::kRxAggregateBytes8733b);
    urb_bytes = rtl8733b::kRxAggregateBytes8733b;
  }
  _logger->info("RTL8733B RX: entering async loop ch={} urb={}x8",
                rx_channel, urb_bytes);
  try {
    _device.bulk_read_async_loop(urb_bytes, 8, on_data, [this]() -> bool {
      return _rx_stop || g_devourer_should_stop;
    });
  } catch (...) {
    _rx_active = false;
    throw;
  }
  _rx_active = false;
  _logger->info(
      "RTL8733B RX: stopped completions={} frames={} malformed={} agg_mismatch={}",
      completions, frames, malformed, aggregate_mismatch);
}

void Rtl8733bDevice::SetMonitorChannel(SelectedChannel channel) {
  std::lock_guard<std::recursive_mutex> lock(_reg_mu);
  /* A window armed before this retune would integrate across the channel
   * change and report the blend of two channels as one channel's occupancy.
   *
   * Inside _reg_mu, which is held across the whole tune below, and which
   * with_ccx takes BEFORE the CCX lock — so a concurrent arm cannot land
   * between this note and the tune. That is the Jaguar2/3 situation, not
   * Jaguar1's, and it is why one note suffices here rather than a pair
   * bracketing the tune.
   *
   * Scoped, and never held across the tune: FastRetune below calls this
   * function on its declined path while already holding _reg_mu (which is
   * recursive, so that part is fine), and the CCX mutex is NOT recursive —
   * holding it across the tune would self-deadlock on that path. */
  {
    std::lock_guard<std::mutex> ccx(busy_window_mutex());
    busy_window_note_retune();
  }
  bring_up_to_phy();
  const bool was_tx_ready = _tx_ready;
  _tx_ready = false;
  if (_tssi_tracking) {
    if (!_phy.disable_tssi_tracking())
      throw std::runtime_error("RTL8733B TSSI rollback before retune failed");
    _tssi_tracking = false;
  }
  if (!_phy.set_channel(channel))
    throw std::runtime_error("RTL8733B channel configuration failed");
  _channel = channel;
  _rx_configured_bw = channel.ChannelWidth == CHANNEL_WIDTH_40 ? 1 : 0;
  if (was_tx_ready) {
    if (!configure_tx_power(channel)) {
      _tx_ready = false;
      throw std::runtime_error("RTL8733B safe TX power reapply failed");
    }
    _tx_ready = true;
  }
}

void Rtl8733bDevice::FastRetune(uint8_t channel, bool cache_rf) {
  std::lock_guard<std::recursive_mutex> lock(_reg_mu);
  if (_phy_ready && channel == _channel.Channel)
    return;
  /* Noted AFTER the same-channel early return above: that path tunes nothing,
   * so spoiling a window there would refuse a measurement that was never
   * disturbed. Scoped for the reason SetMonitorChannel spells out — the
   * declined path below calls it, and the CCX mutex is not recursive. */
  {
    std::lock_guard<std::mutex> ccx(busy_window_mutex());
    busy_window_note_retune();
  }
  SelectedChannel target = _channel;
  target.Channel = channel;
  if (_phy_ready &&
      _phy.fast_retune(target, _tssi_tracking,
                       rtl8733b::kSafeTssiTargetQdbm8733b, cache_rf,
                       _tx_offset_qdb)) {
    _channel = target;
    return;
  }
  /* Fast path declined (band/width change, cold radio) — full channel set at
   * the current width/offset, under the same recursive lock. */
  SetMonitorChannel(target);
}

bool Rtl8733bDevice::send_packet(const uint8_t *packet, size_t length) {
  std::lock_guard<std::recursive_mutex> lock(_reg_mu);
  if (!_phy_ready || !_mac_ready || !_tx_ready) {
    _logger->error("RTL8733B TX rejected before InitWrite");
    return false;
  }
  if (packet == nullptr)
    return false;
  /* No thermal read here. read_thermal() is 3 RF writes + a 15 us settle + an
   * RF read, each several USB control transfers — per frame that dominates the
   * send budget on a USB-HS part, and no other generation does register I/O on
   * the send path. The bring-up snapshot in InitWrite is the baseline; live
   * monitoring rides GetThermalStatus from the caller's own cadence. */
  const uint16_t radiotap_length =
      devourer::radiotap_hdr_len(packet, length);
  if (radiotap_length == 0)
    return false;
  const size_t frame_len = length - radiotap_length;
  const size_t bulk_packet = _device.speed() >= devourer::kUsbSpeedSuper
                                 ? 1024u
                                 : _device.speed() >= devourer::kUsbSpeedHigh
                                       ? 512u
                                       : 64u;
  const uint8_t packet_offset =
      (rtl8733b::kTxDescSize + frame_len) % bulk_packet == 0 ? 1 : 0;
  std::vector<uint8_t> usb_frame(rtl8733b::kTxDescSize +
                                     static_cast<size_t>(packet_offset) * 8u +
                                     frame_len,
                                 0);
  const size_t built = build_tx_block(packet, length, usb_frame.data(),
                                      packet_offset);
  if (built == 0 || built != usb_frame.size())
    return false;

  /* QSEL_MGNT maps to HALMAC's HIGH DMA mapping in the normal 3-bulk-OUT
   * profile, hence bulk-out ID 0 / the first enumerated endpoint (0x05 on the
   * tested f72b). Use synchronous TX so every submission has an
   * immediate, bounded result and no buffer outlives this call. */
  const uint8_t endpoint = _device.first_bulk_out_ep();
  const uint8_t rate_hw = usb_frame[0x10] & 0x7f;
  const uint8_t rate_id = usb_frame[0x06] & 0x1f;
  const uint8_t bandwidth = (usb_frame[0x14] >> 5) & 0x3;
  const uint8_t short_gi = (usb_frame[0x14] >> 4) & 0x1;
  const uint8_t ldpc = (usb_frame[0x14] >> 7) & 0x1;
  const int sent = _device.bulk_send_data_sync_ep(
      endpoint, usb_frame.data(), usb_frame.size(), 100);
  if (sent != static_cast<int>(usb_frame.size())) {
    _logger->error("RTL8733B TX failed/short on EP 0x{:02x}: {}/{}", endpoint,
                   sent, usb_frame.size());
    return false;
  }
  if (_tx_submits.fetch_add(1) == 0) {
    _logger->info(
        "RTL8733B first TX accepted: EP=0x{:02x} bytes={} frame={} shim={} "
        "rate_hw={} rate_id={} bw={} sgi={} ldpc={} fifo={} empty=0x{:04x} "
        "txdma=0x{:08x} pause=0x{:02x} bb_tx_en={} bb_tx_on={}",
        endpoint, sent, frame_len, packet_offset, rate_hw, rate_id, bandwidth,
        short_gi, ldpc,
        _device.rtw_read8(0x0207), _device.rtw_read16(0x041a),
        _device.rtw_read32(0x0210), _device.rtw_read8(0x0522),
        _device.rtw_read16(0x2de0), _device.rtw_read16(0x2de2));
  }
  return true;
}

void Rtl8733bDevice::SetTxMode(const devourer::TxMode &mode) {
  std::lock_guard<std::recursive_mutex> lock(_reg_mu);
  _tx_mode_default = mode;
}

void Rtl8733bDevice::ClearTxMode() {
  std::lock_guard<std::recursive_mutex> lock(_reg_mu);
  _tx_mode_default.reset();
}

SelectedChannel Rtl8733bDevice::GetSelectedChannel() {
  std::lock_guard<std::recursive_mutex> lock(_reg_mu);
  return _channel;
}

size_t Rtl8733bDevice::send_packets(const TxPacketView *pkts, size_t count) {
  const unsigned agg = _cfg.tx.usb_agg_max;
  if (agg <= 1 || !_device.is_usb() || count == 0)
    return IRadio::send_packets(pkts, count);

  std::lock_guard<std::recursive_mutex> lock(_reg_mu);
  if (!_phy_ready || !_mac_ready || !_tx_ready) {
    _logger->error("RTL8733B TX rejected before InitWrite");
    return 0;
  }

  devourer::TxAggLimits lim;
  lim.desc_size = rtl8733b::kTxDescSize;
  lim.bulk_size = _device.speed() >= devourer::kUsbSpeedSuper  ? 1024
                  : _device.speed() >= devourer::kUsbSpeedHigh ? 512
                                                               : 64;
  /* BLK_DESC_NUM: MAC init already programs 3 into DWBCN0_CTRL[7:4]
   * (Halmac8733bMac.cpp) — the same field and value the HalMAC 88xx siblings
   * use — so 3 descriptors per bulk transfer is what this TXDMA parses.
   * Layout is rtw88/HalMAC parity: no first-block PKT_OFFSET reserve. */
  lim.max_frames = std::min<unsigned>(agg, 3u);
  lim.descs_per_bulk = 0;
  lim.first_reserve = false;

  size_t done = 0, ok = 0;
  while (done < count) {
    /* Collect the contiguous run for ONE URB. A frame carrying a radiotap
     * CHANNEL other than the session channel ends the run — this backend does
     * not retune mid-submission, so build_tx_block refuses such a frame
     * outright and it must not be packed beside frames that would have
     * aired. */
    std::vector<size_t> lens;
    for (size_t i = done; i < count && lens.size() < lim.max_frames; ++i) {
      /* A null view is treated exactly like a malformed one: it ends the run
       * and, if it led, is skipped per the IRadio::send_packets
       * contract. */
      const uint16_t rlen =
          pkts[i].data == nullptr
              ? uint16_t{0}
              : devourer::radiotap_hdr_len(pkts[i].data, pkts[i].len);
      if (rlen == 0)
        break;
      const int want =
          devourer::radiotap_peek_channel(pkts[i].data, pkts[i].len);
      if (want > 0 && want != _channel.Channel) {
        /* This backend retunes for nobody mid-submission — build_tx_block
         * refuses an off-channel frame outright. A LEADING one still has to
         * enter the run alone, so the single-frame path below refuses it and
         * `done` moves past it; ending the run empty here instead would spin
         * this loop forever on the same entry, holding _reg_mu. */
        if (lens.empty())
          lens.push_back(pkts[i].len - rlen);
        break;
      }
      lens.push_back(pkts[i].len - rlen);
    }
    if (lens.empty()) {
      /* The leading view was null or malformed. This is also the loop's
       * termination guarantee: `done` advances on every iteration whatever
       * the collector above decided, so no future run rule can reintroduce a
       * non-advancing path. */
      ++done;
      continue;
    }

