OpenIPC/devourer/src/rtl8733b/Rtl8733bDevice.cpp
    const devourer::TxAggPlan plan =
        devourer::plan_tx_agg(lens.data(), lens.size(), lim);
    if (plan.frames() <= 1) {
      /* One block (or a frame the URB cap refuses): the classic single-frame
       * path is byte-identical and uncapped. */
      if (send_packet(pkts[done].data, pkts[done].len))
        ++ok;
      ++done;
      continue;
    }

    /* The block count rides the FIRST descriptor, and it must be in place
     * before that descriptor is checksummed — hence built in, not patched on
     * afterwards the way the 8822C does it (its checksum is recomputable in
     * isolation; this one is folded inside fill_tx_desc_8733b). */
    std::vector<uint8_t> urb(plan.total, 0);
    size_t built = 0;
    for (size_t k = 0; k < plan.frames(); ++k) {
      const uint8_t poff = (k == 0 && plan.shim) ? 1 : 0;
      const uint8_t anum =
          k == 0 ? static_cast<uint8_t>(plan.frames()) : uint8_t{0};
      if (build_tx_block(pkts[done + k].data, pkts[done + k].len,
                         urb.data() + plan.blocks[k].offset, poff, anum) == 0)
        break; /* pre-validated, so only a defensive bail */
      ++built;
    }
    if (built != plan.frames()) {
      for (size_t k = 0; k < plan.frames(); ++k, ++done)
        if (send_packet(pkts[done].data, pkts[done].len))
          ++ok;
      continue;
    }

    const int rc = _device.bulk_send_data_sync_ep(_device.first_bulk_out_ep(),
                                             urb.data(), urb.size(),
                                             /*timeout_ms=*/100);
    /* bulk_send_sync_ep returns BYTES SUBMITTED, so `rc >= 0` also covers a
     * short write. A truncated URB means the chip got a prefix — some
     * trailing block is partial or absent — and there is no way to say which
     * frames aired, so none of them may be reported as submitted. The
     * single-frame path already refuses a short write; the aggregated one
     * must not be the looser of the two in the same backend. */
    const bool sent_all = rc == static_cast<int>(urb.size());
    if (!sent_all)
      /* Both failure shapes reach stderr — rc < 0 (transport error) and a
       * short write — because the single-frame path logs both and this
       * backend has no NAK-backoff flood concern excusing silence. */
      _logger->error("RTL8733B aggregated TX failed/short on EP 0x{:02x}: "
                     "{}/{} ({} frames dropped)",
                     _device.first_bulk_out_ep(), rc, urb.size(),
                     plan.frames());
    devourer::Ev(_logger->events(), "tx.agg")
        .f("frames", (unsigned long long)plan.frames())
        .f("bytes", (unsigned long long)urb.size())
        .f("sent", (long long)rc)
        .f("shim", plan.shim)
        .f("ok", sent_all);
    if (sent_all) {
      ok += plan.frames();
      /* Same one-shot latch send_packet uses — a session whose very first TX
       * is aggregated must still say so once, or the "first TX accepted"
       * breadcrumb goes missing exactly when the packing is what is on
       * trial. It counts URB acceptances, not frames; it is a latch, not a
       * meter. */
      if (_tx_submits.fetch_add(1) == 0)
        _logger->info(
            "RTL8733B first TX accepted (aggregated): EP=0x{:02x} frames={} "
            "bytes={} shim={}",
            _device.first_bulk_out_ep(), plan.frames(), urb.size(), plan.shim);
    }
    done += plan.frames();
  }
  return ok;
}

size_t Rtl8733bDevice::build_tx_block(const uint8_t *packet, size_t length,
                                      uint8_t *out, uint8_t packet_offset,
                                      uint8_t agg_num) {
  if (packet == nullptr || out == nullptr)
    return 0;
  const uint16_t radiotap_length =
      devourer::radiotap_hdr_len(packet, length);
  if (radiotap_length == 0)
    return 0;
  const size_t frame_len = length - radiotap_length;
  /* The monitor-injection path deliberately requires a normal 24-byte
   * 802.11 header and the hardware's 12-bit MPDU-length range. */
  if (frame_len < 24 || frame_len > 4095 || packet_offset > 1)
    return 0;

  uint8_t fixed_rate = MGN_6M;
  ChannelWidth_t frame_width = CHANNEL_WIDTH_20;
  int requested_channel = 0;

  /* A per-packet radiotap rate below remains authoritative. Rate-less frames
   * use the same SetTxMode default as the established backends and txdemo. */
  if (_tx_mode_default) {
    const auto &mode = *_tx_mode_default;
    /* One predicate covers the family (VHT/HE refused outright) and its
     * modulation parameters, so the SetTxMode branch and the radiotap branch
     * below cannot drift apart — and the refusals are testable without
     * hardware (tests/rtl8733b_tx_desc_selftest.cpp). */
    if (!rtl8733b::tx_mode_supported_8733b(mode))
      return 0;
    if (mode.mode == devourer::TxMode::Mode::Legacy) {
      fixed_rate = mode.legacy_rate_500kbps;
    } else {
      fixed_rate = static_cast<uint8_t>(MGN_MCS0 + mode.ht_mcs);
      frame_width = mode.bw_mhz == 40 ? CHANNEL_WIDTH_40 : CHANNEL_WIDTH_20;
    }
  }

  auto *header = reinterpret_cast<struct ieee80211_radiotap_header *>(
      const_cast<uint8_t *>(packet));
  struct ieee80211_radiotap_iterator iterator;
  if (ieee80211_radiotap_iterator_init(&iterator, header, radiotap_length,
                                       nullptr) != 0)
    return 0;
  while (ieee80211_radiotap_iterator_next(&iterator) == 0) {
    switch (iterator.this_arg_index) {
    case IEEE80211_RADIOTAP_RATE:
      fixed_rate = *iterator.this_arg;
      frame_width = CHANNEL_WIDTH_20;
      break;
    case IEEE80211_RADIOTAP_CHANNEL:
      requested_channel =
          devourer::freq_to_chan(get_unaligned_le16(iterator.this_arg));
      if (requested_channel <= 0)
        return 0;
      break;
    case IEEE80211_RADIOTAP_MCS: {
      const auto m = devourer::decode_radiotap_mcs_field(iterator.this_arg);
      if (!m.have_mcs ||
          !rtl8733b::ht_request_supported_8733b(m.mcs, m.bw40 ? 40 : 20,
                                                m.sgi != 0, m.ldpc != 0,
                                                m.stbc != 0))
        return 0;
      fixed_rate = static_cast<uint8_t>(MGN_MCS0 + m.mcs);
      frame_width = m.bw40 ? CHANNEL_WIDTH_40 : CHANNEL_WIDTH_20;
      break;
    }
    case IEEE80211_RADIOTAP_VHT:
    case IEEE80211_RADIOTAP_HE:
      return 0; // RTL8733B contract is legacy CCK/OFDM + HT 1SS only
    default:
      break;
    }
  }

  /* This initial path does not retune during a submission. Refuse a mismatched
   * radiotap CHANNEL instead of silently airing on the session channel. */
  if (requested_channel > 0 && requested_channel != _channel.Channel)
    return 0;

  if (frame_width == CHANNEL_WIDTH_40 &&
      _channel.ChannelWidth != CHANNEL_WIDTH_40)
    return 0;
  if (_channel.ChannelWidth != CHANNEL_WIDTH_20 &&
      _channel.ChannelWidth != CHANNEL_WIDTH_40 &&
      _channel.ChannelWidth != CHANNEL_WIDTH_5 &&
      _channel.ChannelWidth != CHANNEL_WIDTH_10)
    return 0;

  uint8_t data_sc = 0;
  if (_channel.ChannelWidth == CHANNEL_WIDTH_40 &&
      frame_width == CHANNEL_WIDTH_20) {
    data_sc = _channel.ChannelOffset == 2
                  ? 1 // primary is upper 20 MHz
                  : _channel.ChannelOffset == 1 ? 2 : 0;
  }

