OpenIPC/devourer/src/rtl8733b/Rtl8733bDevice.cpp
  const uint8_t *dot11 = packet + radiotap_length;
  const uint16_t sequence = static_cast<uint16_t>(
      (static_cast<uint16_t>(dot11[22]) |
       (static_cast<uint16_t>(dot11[23]) << 8)) >>
      4);
  const bool bmc = (dot11[4] & 1u) != 0;
  rtl8733b::TxDescConfig cfg;
  cfg.packet_size = static_cast<uint16_t>(frame_len);
  cfg.sequence = sequence;
  cfg.rate_hw = MRateToHwRate(fixed_rate);
  cfg.bandwidth = frame_width == CHANNEL_WIDTH_40 ? 1 : 0;
  cfg.rate_id = rtl8733b::tx_rate_id_8733b(
      cfg.rate_hw, cfg.bandwidth, _channel.Channel > 14);
  cfg.data_sc = data_sc;
  cfg.packet_offset = packet_offset;
  cfg.agg_num = agg_num;
  cfg.retry_limit = static_cast<uint8_t>(
      std::clamp(_cfg.tx.retry_limit, 0, 63));
  cfg.short_gi = false;
  cfg.ldpc = false;
  cfg.bmc = bmc;
  if (!rtl8733b::fill_tx_desc_8733b(out, rtl8733b::kTxDescSize, cfg)) {
    _logger->error("RTL8733B TX rejected: unsupported rate/width/coding");
    return 0;
  }

  const size_t frame_offset =
      rtl8733b::kTxDescSize + static_cast<size_t>(packet_offset) * 8u;
  std::memcpy(out + frame_offset, dot11, frame_len);
  return frame_offset + frame_len;
}

bool Rtl8733bDevice::SetAckResponder(const devourer::MacAddr &mac) {
  std::lock_guard<std::recursive_mutex> lock(_reg_mu);
  if (!_mac_ready) {
    _logger->error("RTL8733B: ACK responder requires MAC bring-up first");
    return false;
  }
  /* The AckResponder.h recipe is map-identical on this die, which is not an
   * assumption: the vendor 8733BU tree's port-0 descriptor names exactly these
   * three registers — net_type = REG_CR_8733B + 2 (0x0100 + 2 = 0x0102, shift
   * 0), macaddr = REG_MACID_8733B (0x0610), bssid = REG_BSSID_8733B (0x0618)
   * (hal/rtl8733b/rtl8733b_ops.c port_cfg[0], hal/halmac/halmac_reg_8733b.h).
   *
   * MAC bring-up leaves net_type at 0 (No Link) but programs the adapter MAC
   * into MACID. NoLink does not silence this die: the port already answers for
   * that identity. SetAckResponder applies the shared register recipe while
   * retargeting MACID; ClearAckResponder must move MACID back. */
  if (!devourer::ack::is_unicast(mac.data())) {
    _logger->error("RTL8733B: ACK responder needs a UNICAST MAC (I/G set in "
                   "{:02x}) — not armed",
                   mac.bytes[0]);
    return false;
  }
  if (!devourer::ack::enable(_device, mac.data())) {
    /* enable() writes MACID before its final gate write, so a failure here can
     * leave the identity ON the responder address — a live responder on this
     * die. Roll back through the same disarm ClearAckResponder uses. */
    if (!disarm_ack_responder()) {
      _logger->error(
          "RTL8733B: ACK responder arm failed with hardware state UNKNOWN");
    } else {
      _logger->error(
          "RTL8733B: ACK responder register write failed — not armed");
    }
    return false;
  }
  /* Verify with the shared readback rather than a local copy of the map:
   * this backend does not report a write it cannot confirm. A failed arm is
   * rolled back and the NoLink gate is read back before false is returned. */
  if (!devourer::ack::verify(_device, mac.data())) {
    if (!disarm_ack_responder()) {
      _logger->error(
          "RTL8733B: ACK responder verify failed with hardware state UNKNOWN");
    } else {
      _logger->error("RTL8733B: ACK responder did not latch for "
                     "{:02x}:{:02x}:{:02x}:{:02x}:{:02x}:{:02x}",
                     mac.bytes[0], mac.bytes[1], mac.bytes[2], mac.bytes[3],
                     mac.bytes[4], mac.bytes[5]);
    }
    return false;
  }
  _logger->info("RTL8733B: hardware ACK responder armed for "
                "{:02x}:{:02x}:{:02x}:{:02x}:{:02x}:{:02x} (net_type=AP)",
                mac.bytes[0], mac.bytes[1], mac.bytes[2], mac.bytes[3],
                mac.bytes[4], mac.bytes[5]);
  return true;
}

/* The disarm, shared by ClearAckResponder and SetAckResponder's rollback.
 *
 * BOTH halves are attempted and neither gates the other. The gate write is
 * kept for the generations where it means something and because leaving
 * net_type set would be untidy, but on this die it changes nothing: measured,
 * a never-armed port answers on its own MAC at 85.2 % / 82.5 % against 0.0 %
 * for an address nobody holds, and an armed one at 83.3 % — so the engine
 * matches MACID and 0x0102[1:0] is inert. The identity half is therefore the
 * one that decides anything, and it must not be skipped because a transport
 * read for the half that decides nothing happened to throw.
 *
 * Restores the adapter's own MAC — what initialize()'s program_mac wrote — not
 * zero: many Realtek MAC TX paths refuse to schedule a frame when the MAC ID
 * is zero (the T1 canary bug REG_MACID programming exists to fix,
 * src/jaguar1/HalModule.cpp), and a radio being disarmed live may still be
 * injecting. _efuse.mac is always valid here: initialize() refuses to bring the
 * MAC up without mac_valid(), and _mac_ready is set only after that succeeded.
 *
 * This returns the port to the state a never-armed session ships in. It does
 * NOT make it silent — on this die nothing can, short of taking the MAC down —
 * and the log says so. */
bool Rtl8733bDevice::disarm_ack_responder() {
  const bool gate = devourer::ack::disable_verified(_device);
  if (!gate)
    _logger->error("RTL8733B: ACK responder gate did not latch closed — "
                   "continuing to the identity, which is what this die "
                   "actually matches on");
  const bool transfer = devourer::ack::retarget(_device, _efuse.mac.data());
  /* A failed transfer status does not prove the write had no effect. Always
   * perform the authoritative identity readback rather than short-circuiting
   * it on `transfer`. */
  const bool id = devourer::ack::macid_is(_device, _efuse.mac.data());
  if (!id) {
    _logger->error("RTL8733B: ACK responder MACID could not be restored — the "
                   "port may still answer for the responder address");
    return false;
  }
  if (!transfer)
    _logger->warn("RTL8733B: ACK responder MACID write reported a transport "
                  "failure, but identity readback confirms the adapter's "
                  "own address");
  _logger->info("RTL8733B: hardware ACK responder disarmed (MACID back to the "
                "adapter's own address; this port answers for that address "
                "either way on this die)");
  /* Identity is the measured disarm result on this die. A failed/inert gate
   * readback is diagnosed above but must not turn a verified identity move
   * into the contradictory caller result "hardware state UNKNOWN". */
  return true;
}

