OpenIPC/devourer/src/rtl8733b/Rtl8733bDevice.cpp
void Rtl8733bDevice::ClearAckResponder() {
  std::lock_guard<std::recursive_mutex> lock(_reg_mu);
  if (!_mac_ready)
    return;
  (void)disarm_ack_responder();
}

void Rtl8733bDevice::SetCcaMode(bool disabled) {
  if (!disabled) {
    /* `false` is the universal default — carrier-sense + EDCCA enabled — and
     * that is exactly what this backend's HALMAC MAC bring-up leaves
     * programmed. Succeed as a no-op: callers that assert the default
     * unconditionally (examples/timesync) must not be punished for asking for
     * the state the chip is already in. */
    return;
  }
  /* `true` (DEVOURER_DIS_CCA) is not ported. The HALMAC 87xx carrier-sense
   * gate has not been located and measured on this part, and this backend
   * does not guess at PHY/MAC writes it cannot read back. Refuse loudly, per
   * the pure-virtual contract in IRadio — but do NOT tear the session
   * down: an unsupported optional knob is not a hardware-safety event, and
   * card-disabling here would leave the caller with a dead chip for asking a
   * question. The session stays up with standard carrier-sense. */
  _logger->error(
      "RTL8733B: CCA disable (DEVOURER_DIS_CCA) is not implemented by this "
      "backend; carrier-sense stays enabled");
  throw std::runtime_error(
      "RTL8733B CCA disable is not implemented by this backend");
}

void Rtl8733bDevice::Stop() {
  std::lock_guard<std::recursive_mutex> lock(_reg_mu);
  /* The armed window dies with the session. Clearing _phy_ready below is not
   * enough on its own: SetMonitorChannel and FastRetune both call
   * bring_up_to_phy(), which sets it true again, so a window armed before a
   * Stop would come back to life on the revived chip — and the retune note
   * would hand the caller a Retuned spoil earned by a hardware session that
   * no longer exists. Invalid either way, but the reason would be a lie.
   *
   * Scoped, and taken under _reg_mu (already held) in the house order. Never
   * held across the teardown I/O below: nothing Stop() calls re-enters this
   * class, but the CCX mutex is non-recursive and this is not the place to
   * start depending on that. */
  {
    std::lock_guard<std::mutex> ccx(busy_window_mutex());
    busy_window_reset();
  }
  _rx_stop = true;
  _device.quiesce_tx();
  _tx_ready = false;
  if (_tssi_tracking) {
    try {
      if (!_phy.disable_tssi_tracking())
        _logger->warn("RTL8733B TSSI rollback did not match before shutdown");
    } catch (const std::exception &e) {
      /* A disconnect can make rollback reads fail. Continue into MAC/card
       * shutdown: leaving the teardown half-run is less safe than losing the
       * readback assertion after the USB device has gone away. */
      _logger->warn("RTL8733B TSSI rollback failed during shutdown: {}",
                    e.what());
    }
    _tssi_tracking = false;
  }
  _phy_ready = false;
  if (_mac_ready) {
    _mac.stop();
    _mac_ready = false;
  }
  _firmware_ready = false;
  if (_power_ready && _cfg.tuning.teardown_power_down) {
    if (!_bringup.power_off())
      _logger->warn("RTL8733B card-disable sequence did not reach off state");
    _power_ready = false;
  }
}

devourer::TxCaps Rtl8733bDevice::GetTxCaps() {
  /* Advertised surface: one spatial stream, 2.4-GHz long-preamble CCK, legacy
   * OFDM, and HT MCS0-7 at 20/40 MHz. TxCaps has no separate CCK flag. Keep SGI
   * false: an independent receiver decoded a descriptor-SGI probe as long GI.
   * The vendor advertises TX-LDPC (but not RX-LDPC); this raw-injection backend
   * keeps it false because only forced-global-BCC operation has passed
   * independently witnessed injection. Experimental 5/10 MHz is likewise
   * omitted until an occupied-bandwidth and cross-receiver gate passes. */
  return devourer::tx_caps_for_chains(1, false, false, 40);
}

devourer::AdapterCaps Rtl8733bDevice::GetAdapterCaps() {
  devourer::AdapterCaps caps;
  caps.supported = true;
  caps.chip_name = "RTL8733B";
  caps.marketing_names = "RTL8731BU/RTL8733BU";
  caps.chip_id = rtl8733b::kChipId;
  caps.generation = devourer::ChipGeneration::Rtl8733b;
  /* Busy airtime yes, phydm counters no — and this die is the first backend
   * where those two split.
   *
   * CCX CLM is ported (see with_ccx), on the JGR3 map the vendor puts this
   * die on (phydm_pre_define.h:513 and :523-525 at the pinned
   * reference/rtl8733bu-20230626). It needs no IGI reference —
   * arm_clm_only/read_clm_only take none, because busy airtime is a tick
   * count rather than a histogram referenced to the receiver's own floor — so
   * it works here even though the phydm FA/CCA block is not wired up and
   * GetRxEnergy is not overridden. The sampled path consequently still
   * reports NO READING; the armed window (IRadio::ArmChannelBusy) is how a
   * caller gets a number out of this backend.
   *
   * rx_energy_ok stays false, which is the half of the old caps note that was
   * always right: the IRtlRadio cast would imply an FA/CCA/IGI reader that
   * does not exist here. */
  caps.busy_airtime_ok = true;
  /* Separated on air through tests/busy_window_probe.sh on an RTL8733BU
   * against an MT7612U flooder on ch165: 0% quiet, 69% under a steady load,
   * and a 50/450 ms burst (true duty ~9%) at a mean of 6-10% over five
   * windows with a 19-point spread — a 240 ms window inside a 500 ms burst
   * period misses whole bursts, so only the mean means anything there. A
   * Jaguar3 8812CU on the same flooder read 69% too, so the two register
   * paths agree on one load. Every spoiler refused with its reason. */
  caps.busy_airtime_measured = true;
  caps.rx_energy_ok = false;
  caps.variant = "cut-selected";
  caps.transport = _device.is_usb() ? "usb" : "unknown";
  caps.tx_chains = 1;
  caps.rx_chains = 1;
  caps.tx = GetTxCaps();
  caps.bw_mask = devourer::bw_mask_for_generation(caps.generation);
  caps.tune_2g4 = {true, 2412, 2484};
  caps.characterized_2g4 = caps.tune_2g4;
  /* The production channel planner intentionally accepts only standard
   * 5-GHz channels 36..177, not the wider Jaguar extended-frequency range. */
  caps.tune_5g = {true, 5180, 5885};
  caps.characterized_5g = {true, 5180, 5825};
  caps.hw_rx_timestamp = true;
  /* Lean FastRetune override exists (Phy8733b::fast_retune): intra-band,
   * same-width hops with TSSI tracking kept live. Measured on the
   * validation unit: ~55 ms call / ~10 ms p50 radio-live, vs the
   * ~330-440 ms full path (USB HS). */
  caps.fastretune_ok = true;
  /* 10 MHz only — kBw5 is deliberately absent from bw_mask and WIDTH_5 is
   * refused at channel_plan: on this die the 5 MHz BB small-BW mode airs no
   * packets (measured across the full DAC/ADC divider code space), while
   * 10 MHz is SDR- and cross-decode-qualified on both bands
   * (docs/rtl8733b.md "Narrowband status"). */
  caps.narrowband_ok = true;
  /* Hardware ARQ (truth table at the AdapterCaps declarations): both knobs
   * measured true on this die. The responder had to be proven before the TX
   * side could be, because this die has no CCX path to judge its own frames —
   * so the retry knob is witnessed from the air instead of from tx.report
   * (tests/rtl8733b_retry_limit_onair.sh; bench narrative in
   * src/rtl8733b/CLAUDE.md "Hardware ARQ"). */
  caps.ack_responder_ok = true;
  caps.tx_retry_limit_ok = true;
  caps.txpwr = GetTxPowerCaps();
  return caps;
}

