OpenIPC/devourer/src/rtl8733b/Rtl8733bDevice.cpp
  if (!_tx_ready) {
    /* Recorded now, applied by configure_tx_power at InitWrite — the family
     * contract for a knob moved before the chip is up. */
    _tx_offset_qdb = static_cast<int16_t>(applied);
    _tx_sat_low = req_low;
    _tx_sat_high = req_high;
    _logger->info("RTL8733B: TX-power offset {} qdB recorded (requested {}), "
                  "applied at InitWrite",
                  applied, qdb);
    return applied;
  }

  rtl8733b::TssiOffsetSat8733b sat;
  if (!_phy.set_tssi_offset(_channel, rtl8733b::kSafeTssiTargetQdbm8733b,
                            applied, &sat))
    return 0;
  _tx_offset_qdb = static_cast<int16_t>(applied);
  _tx_sat_low = sat.low || req_low;
  _tx_sat_high = sat.high || req_high;
  _logger->info("RTL8733B: SetTxPowerOffsetQdb({}) -> applied {} qdB "
                "(target {} qdBm) sat_low={} sat_high={}",
                qdb, applied,
                rtl8733b::kSafeTssiTargetQdbm8733b + applied, _tx_sat_low,
                _tx_sat_high);
  return applied;
}

devourer::TxPowerState Rtl8733bDevice::GetTxPowerState() {
  std::lock_guard<std::recursive_mutex> lock(_reg_mu);
  devourer::TxPowerState s;
  if (!_phy_ready || !_tx_ready)
    return s; /* valid=false — no TX-power state has been programmed yet. */
  s.valid = true;

  if (!_tssi_tracking) {
    /* Flat-PG unit: no actuator, but the TXAGC registers ARE the level and
     * they read back, so report chip truth. set_flat_tx_power writes one index
     * to both references and zeroes the per-rate diffs, so every
     * representative rate sits at that index. */
    const rtl8733b::TxAgcState8733b agc = _phy.read_txagc_state();
    /* Note the reading this shares with src/TxPower.h's convention: there,
     * flat_index >= 0 means "a flat override is active" and clearing it is the
     * caller's move.  Here nothing can have set one — SetTxPowerIndexOverride
     * refuses — and there is nothing to clear.  The index is simply what this
     * unit runs at, because a no-TSSI-calibration EFUSE leaves bring-up's flat
     * index as the level.  A consumer reaching for
     * SetTxPowerIndexOverride(-1) to "release" it gets a logged refusal, which
     * is the honest answer: this unit has no runtime power actuator at all. */
    s.flat_index = agc.ofdm_ref_a;
    s.cck_index = agc.cck_ref_a;
    s.ofdm_index = agc.ofdm_ref_a;
    s.mcs7_index = agc.ofdm_ref_a;
    s.hw_readback = true;
    return s;
  }

  /* TSSI path: a dBm-target model, so there is no TXAGC index to report and
   * flat_index / the three representative fields stay -1 rather than carrying
   * quarter-dBm targets in fields declared as indices (Kestrel reports the
   * same shape). hw_readback says the offset below was confirmed against the
   * chip's live target table, not just read out of this shadow — the
   * distinction a consumer needs when the whole failure mode being fixed was a
   * shadow that always agreed with itself. */
  s.offset_qdb = _tx_offset_qdb;
  s.offset_steps = _tx_offset_qdb; /* 1 step == 1 qdB on the dBm model */
  s.saturated_low = _tx_sat_low;
  s.saturated_high = _tx_sat_high;
  s.hw_readback = _phy.tssi_offsets_confirmed(
      _channel, rtl8733b::kSafeTssiTargetQdbm8733b, _tx_offset_qdb);
  /* Latched, because this is a getter a control loop polls: an unconfirmed
   * chip would otherwise emit one warning per poll forever. The state field is
   * the machine-readable signal; the log line only has to fire the first
   * time. */
  if (!s.hw_readback && !_tx_readback_warned) {
    _tx_readback_warned = true;
    _logger->warn("RTL8733B: TX-power state unconfirmed — the chip's TSSI "
                  "target table does not match the {} qdB offset this session "
                  "believes it applied (warned once)",
                  _tx_offset_qdb);
  }
  return s;
}

devourer::ThermalStatus Rtl8733bDevice::GetThermalStatus() {
  std::lock_guard<std::recursive_mutex> lock(_reg_mu);
  devourer::ThermalStatus status;
  if (!_phy_ready)
    return status;
  status.raw = _phy.read_thermal();
  status.baseline = _efuse.thermal;
  status.valid = status.raw != 0 && status.baseline != 0xff;
  status.delta = status.valid ? static_cast<int>(status.raw) -
                                  static_cast<int>(status.baseline)
                              : 0;
  return status;
}

bool Rtl8733bDevice::GetPermanentMacAddress(uint8_t out[6]) {
  std::lock_guard<std::recursive_mutex> lock(_reg_mu);
  if (out == nullptr || !_efuse.valid || !_efuse.mac_valid())
    return false;
  std::copy(_efuse.mac.begin(), _efuse.mac.end(), out);
  return true;
}

devourer::EfuseStability Rtl8733bDevice::ProbeEfuseStability(int reads) {
  std::lock_guard<std::recursive_mutex> lock(_reg_mu);
  if (!_mac_ready)
    return {};
  auto status = devourer::ProbeEfuseStabilityImpl(
      [this](uint8_t *map) {
        rtl8733b::EfuseInfo fresh;
        if (!_mac.read_efuse(fresh))
          return false;
        std::copy(fresh.logical.begin(), fresh.logical.end(), map);
        return true;
      },
      static_cast<uint16_t>(rtl8733b::kLogicalEfuseSize), reads);
  _logger->info(
      "RTL8733B EFUSE stability: reads={} mismatched={} invalid_id={} "
      "id=0x{:04x}",
      status.reads, status.mismatched_reads, status.invalid_id_reads,
      status.eeprom_id);
  return status;
}

devourer::FwBootStatus Rtl8733bDevice::GetFwBootStatus() {
  std::lock_guard<std::recursive_mutex> lock(_reg_mu);
  return _fw_boot;
}
